Revit 2027 API
SpecTypeId.PipingDensity Property
 Density, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PipingDensity { get; }
Public Shared ReadOnly Property PipingDensity As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PipingDensity {
	ForgeTypeId^ get ();
}
static member PipingDensity : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace